In [1]:
import numpy as np
import pandas as pd

In [81]:
labels = ['a', 'b', 'c', 'd', 'e']
mylist = [1, 2, 3, 4, 5]
arr = np.array([1, 2, 3, 4, 5])
d = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5}

In [82]:
pd.Series(mylist)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [10]:
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
pd.Series(d)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [2]:
series = pd.Series([1,2,3,4,5])
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David'],
    'age': [25, 30, 35, 20],
    'city': ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'salary': [70000, 80000, 120000, 60000],
}
pd.DataFrame(data)

      name  age         city  salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   20      Houston   60000

In [18]:
data_list = [
    ['Alice', 25, 'New York', 70000],
    ['Bob', 30, 'Los Angeles', 80000],
    ['Charlie', 35, 'Chicago', 120000],
    ['David', 20, 'Houston', 60000],
]
df2 = pd.DataFrame(data_list, columns=['name', 'age', 'city', 'salary'])
df2

      name  age         city  salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   20      Houston   60000

In [21]:
df2[['name', 'age']]

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   20

In [22]:
#creating a column
df2['experience'] = [2, 5, 10, 1]
df2

      name  age         city  salary  experience
0    Alice   25     New York   70000           2
1      Bob   30  Los Angeles   80000           5
2  Charlie   35      Chicago  120000          10
3    David   20      Houston   60000           1

In [25]:
df2.drop('experience', axis=1)
df2

      name  age         city  salary  experience
0    Alice   25     New York   70000           2
1      Bob   30  Los Angeles   80000           5
2  Charlie   35      Chicago  120000          10
3    David   20      Houston   60000           1

In [26]:
df2.drop('experience', axis=1, inplace=True)
df2

      name  age         city  salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   20      Houston   60000

In [51]:
df2 = pd.DataFrame(data_list, columns=['new', 'mark', 'some', 'time'], index=['a', 'b', 'c', 'd'])
df2

       new  mark         some    time
a    Alice    25     New York   70000
b      Bob    30  Los Angeles   80000
c  Charlie    35      Chicago  120000
d    David    20      Houston   60000

In [52]:
df2.drop(['a', 'b'], axis=0, inplace=True)
df2

       new  mark     some    time
c  Charlie    35  Chicago  120000
d    David    20  Houston   60000

In [69]:
data_list = [
    ['Alice', 25, 'New York', 70000],
    ['Bob', 30, 'Los Angeles', 80000],
    ['Charlie', 35, 'Chicago', 120000],
    ['David', 20, 'Houston', 60000],
]
df2 = pd.DataFrame(data_list, columns=['name', 'age', 'city', 'salary'])
df2

      name  age         city  salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000
3    David   20      Houston   60000

In [71]:
df2.loc[[0,3]]

    name  age      city  salary
0  Alice   25  New York   70000
3  David   20   Houston   60000

In [75]:
df2.iloc[3]

name        David
age            20
city      Houston
salary      60000
Name: 3, dtype: object

In [76]:
df2.iloc[[0, 3]][['name', 'salary']]

    name  salary
0  Alice   70000
3  David   60000

In [80]:
df2[df2['age'] > 20]

      name  age         city  salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000

In [89]:
 df2[(df2['age'] > 20) & (df2['salary'] > 70000)]

      name  age         city  salary
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago  120000

In [99]:
data_list = [
    [np.nan, 25, 'New York', 70000],
    ['Bob', 30, 'San francisco', 80000],
    ['Charlie', 35, 'Chicago', np.nan],
    ['David', np.nan, 'Houston', 60000],
]
df2 = pd.DataFrame(data_list, columns=['name', 'age', 'city', 'salary'])
df2

      name   age           city   salary
0      NaN  25.0       New York  70000.0
1      Bob  30.0  San francisco  80000.0
2  Charlie  35.0        Chicago      NaN
3    David   NaN        Houston  60000.0

In [100]:
df2.isna()

    name    age   city  salary
0   True  False  False   False
1  False  False  False   False
2  False  False  False    True
3  False   True  False   False

In [101]:
df2.isna().sum()

name      1
age       1
city      0
salary    1
dtype: int64

In [102]:
df2.isna().any()

name       True
age        True
city      False
salary     True
dtype: bool

In [103]:
df2.dropna()

  name   age           city   salary
1  Bob  30.0  San francisco  80000.0

In [104]:
df2

      name   age           city   salary
0      NaN  25.0       New York  70000.0
1      Bob  30.0  San francisco  80000.0
2  Charlie  35.0        Chicago      NaN
3    David   NaN        Houston  60000.0

In [106]:
value = {
    'name': 'Unknown',
    'age': 0,
    'city': 'Unknown',
    'salary': 0
}
df2.fillna(value)

      name   age           city   salary
0  Unknown  25.0       New York  70000.0
1      Bob  30.0  San francisco  80000.0
2  Charlie  35.0        Chicago      0.0
3    David   0.0        Houston  60000.0

In [116]:
employee = pd.DataFrame({
    'employee_name': ['John', 'Jane', 'Doe', 'Smith'],
    'employee_id': [100, 102, 103, 104],
    'city': ['San Francisco', 'Los Angeles', 'New York', 'Chicago'],
    'department': ['Engineering', 'Marketing', 'Sales', 'HR'],
})
salary = pd.DataFrame({
    'employee_id': [101, 102, 103, 105],
    'salary': [90000, 85000, 95000, 80000],
    'bonus': [5000, 4000, 6000, 3000]
})
salary

   employee_id  salary  bonus
0          101   90000   5000
1          102   85000   4000
2          103   95000   6000
3          105   80000   3000

In [117]:
employee

  employee_name  employee_id           city   department
0          John          100  San Francisco  Engineering
1          Jane          102    Los Angeles    Marketing
2           Doe          103       New York        Sales
3         Smith          104        Chicago           HR

In [118]:
pd.merge(employee, salary, on='employee_id')

  employee_name  employee_id         city department  salary  bonus
0          Jane          102  Los Angeles  Marketing   85000   4000
1           Doe          103     New York      Sales   95000   6000

In [119]:
pd.merge(employee, salary, on='employee_id',how='left')

  employee_name  employee_id           city   department   salary   bonus
0          John          100  San Francisco  Engineering      NaN     NaN
1          Jane          102    Los Angeles    Marketing  85000.0  4000.0
2           Doe          103       New York        Sales  95000.0  6000.0
3         Smith          104        Chicago           HR      NaN     NaN

In [120]:
pd.merge(employee, salary, on='employee_id',how='right')

  employee_name  employee_id         city department  salary  bonus
0           NaN          101          NaN        NaN   90000   5000
1          Jane          102  Los Angeles  Marketing   85000   4000
2           Doe          103     New York      Sales   95000   6000
3           NaN          105          NaN        NaN   80000   3000

In [121]:
pd.merge(employee, salary, on='employee_id',how='inner')

  employee_name  employee_id         city department  salary  bonus
0          Jane          102  Los Angeles  Marketing   85000   4000
1           Doe          103     New York      Sales   95000   6000

In [122]:
pd.merge(employee, salary, on='employee_id',how='outer')

  employee_name  employee_id           city   department   salary   bonus
0          John          100  San Francisco  Engineering      NaN     NaN
1           NaN          101            NaN          NaN  90000.0  5000.0
2          Jane          102    Los Angeles    Marketing  85000.0  4000.0
3           Doe          103       New York        Sales  95000.0  6000.0
4         Smith          104        Chicago           HR      NaN     NaN
5           NaN          105            NaN          NaN  80000.0  3000.0

In [123]:
pd.concat([employee, salary], axis=1)

,employee_name,employee_id,city,department,employee_id,salary,bonus
0,John,100,San Francisco,Engineering,101,90000,5000
1,Jane,102,Los Angeles,Marketing,102,85000,4000
2,Doe,103,New York,Sales,103,95000,6000
3,Smith,104,Chicago,HR,105,80000,3000

In [124]:
pd.concat([salary, employee], axis=1)

,employee_id,salary,bonus,employee_name,employee_id,city,department
0,101,90000,5000,John,100,San Francisco,Engineering
1,102,85000,4000,Jane,102,Los Angeles,Marketing
2,103,95000,6000,Doe,103,New York,Sales
3,105,80000,3000,Smith,104,Chicago,HR

In [125]:
pd.concat([employee, salary], axis=0)

  employee_name  employee_id           city   department   salary   bonus
0          John          100  San Francisco  Engineering      NaN     NaN
1          Jane          102    Los Angeles    Marketing      NaN     NaN
2           Doe          103       New York        Sales      NaN     NaN
3         Smith          104        Chicago           HR      NaN     NaN
0           NaN          101            NaN          NaN  90000.0  5000.0
1           NaN          102            NaN          NaN  85000.0  4000.0
2           NaN          103            NaN          NaN  95000.0  6000.0
3           NaN          105            NaN          NaN  80000.0  3000.0

In [139]:
employee

  employee_name  employee_id           city   department
0          John          100  San Francisco  Engineering
1          Jane          102    Los Angeles    Marketing
2           Doe          103       New York        Sales
3         Smith          104        Chicago           HR

In [140]:
salary

   employee_id  salary  bonus
0          101   90000   5000
1          102   85000   4000
2          103   95000   6000
3          105   80000   3000

In [167]:
data = {
    'categories': ['a', 'b', 'b', 'a', 'a', 'b','a', 'b'],
    'store': ['s1', 's1', 's2', 's2', 's1', 's2','s2', 's1'],
    'sales': [100, 200, 150, 300, 250, 400, 350, 500],
    'quantity': [10, 20, 15, 30, 25, 40, 35, 50],
    'date': pd.date_range(start='2023-01-01', periods=8, freq='D')
}
df = pd.DataFrame(data)
df

  categories store  sales  quantity       date
0          a    s1    100        10 2023-01-01
1          b    s1    200        20 2023-01-02
2          b    s2    150        15 2023-01-03
3          a    s2    300        30 2023-01-04
4          a    s1    250        25 2023-01-05
5          b    s2    400        40 2023-01-06
6          a    s2    350        35 2023-01-07
7          b    s1    500        50 2023-01-08

In [178]:
g_cat = df.groupby('categories')
for i, j in g_cat:
    print(i, j)

a   categories store  sales  quantity       date
0          a    s1    100        10 2023-01-01
3          a    s2    300        30 2023-01-04
4          a    s1    250        25 2023-01-05
6          a    s2    350        35 2023-01-07
b   categories store  sales  quantity       date
1          b    s1    200        20 2023-01-02
2          b    s2    150        15 2023-01-03
5          b    s2    400        40 2023-01-06
7          b    s1    500        50 2023-01-08

In [179]:
g_cat = df.groupby('categories')['sales'].sum()
print(g_cat)

categories
a    1000
b    1250
Name: sales, dtype: int64

In [181]:
g_cat = df.groupby('store')['sales'].sum()
g_cat

store
s1    1050
s2    1200
Name: sales, dtype: int64

In [185]:
g_cat = df.groupby(['categories','store'])
g_cat['sales'].sum()

categories  store
a           s1       350
            s2       650
b           s1       700
            s2       550
Name: sales, dtype: int64

In [189]:
s_mean = df['sales'].mean()
q_mean = df['quantity'].mean()
print(s_mean, q_mean)

281.25 28.125

In [191]:
df['sales'].agg(['sum', 'mean', 'max', 'min'])

sum     2250.00
mean     281.25
max      500.00
min      100.00
Name: sales, dtype: float64

In [193]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': ['East', 'West', 'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West',
               'North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North', 'South'],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': ['John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary',
            'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice', 'John', 'Mary', 'Bob', 'Alice']
}
df = pd.DataFrame(data)
df

         Date Product Region  Sales  Units    Rep
0  2023-01-01       A   East    665     87   John
1  2023-01-02       B   West    616     96   Mary
2  2023-01-03       C  North    467     66    Bob
3  2023-01-04       D  South    283     88  Alice
4  2023-01-05       A   East    733     76   John
5  2023-01-06       B   West    802     51   Mary
6  2023-01-07       C  North    625     48    Bob
7  2023-01-08       D  South    454     50  Alice
8  2023-01-09       A   East    207     45   John
9  2023-01-10       B   West    283     41   Mary
10 2023-01-11       C  North    442     77    Bob
11 2023-01-12       D  South    522     42  Alice
12 2023-01-13       A   East    483     19   John
13 2023-01-14       B   West    662     23   Mary
14 2023-01-15       C  North    888     85    Bob
15 2023-01-16       D  South    783     38  Alice
16 2023-01-17       A   East    828     22   John
17 2023-01-18       B   West    798     43   Mary
18 2023-01-19       C  North    885     68    Bob
19 2023-01-20       D  South    555     67  Alice

In [196]:
pd.pivot_table(df, values='Sales', index='Region', columns='Product')

Product      A      B      C      D
Region
East     583.2    NaN    NaN    NaN
North      NaN    NaN  661.4    NaN
South      NaN    NaN    NaN  519.4
West       NaN  632.2    NaN    NaN

In [202]:
pd.crosstab(df['Region'],df['Product'])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0

In [203]:
df.shape

(20, 6)

In [204]:
df.columns

Index(['Date', 'Product', 'Region', 'Sales', 'Units', 'Rep'], dtype='object')

In [206]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Date     20 non-null     datetime64[ns]
 1   Product  20 non-null     object
 2   Region   20 non-null     object
 3   Sales    20 non-null     int64
 4   Units    20 non-null     int64
 5   Rep      20 non-null     object
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 1.1+ KB

                      Date       Sales      Units
count                   20   20.000000  20.000000
mean   2023-01-10 12:00:00  599.050000  56.600000
min    2023-01-01 00:00:00  207.000000  19.000000
25%    2023-01-05 18:00:00  463.750000  41.750000
50%    2023-01-10 12:00:00  620.500000  50.500000
75%    2023-01-15 06:00:00  786.750000  76.250000
max    2023-01-20 00:00:00  888.000000  96.000000
std                    NaN  204.870299  23.394556

In [214]:
def square(x):
    return x * x

df['sale_square'] = df['Sales'].apply(square)

In [215]:
df

         Date Product Region  Sales  Units    Rep  sale_square
0  2023-01-01       A   East    665     87   John       442225
1  2023-01-02       B   West    616     96   Mary       379456
2  2023-01-03       C  North    467     66    Bob       218089
3  2023-01-04       D  South    283     88  Alice        80089
4  2023-01-05       A   East    733     76   John       537289
5  2023-01-06       B   West    802     51   Mary       643204
6  2023-01-07       C  North    625     48    Bob       390625
7  2023-01-08       D  South    454     50  Alice       206116
8  2023-01-09       A   East    207     45   John        42849
9  2023-01-10       B   West    283     41   Mary        80089
10 2023-01-11       C  North    442     77    Bob       195364
11 2023-01-12       D  South    522     42  Alice       272484
12 2023-01-13       A   East    483     19   John       233289
13 2023-01-14       B   West    662     23   Mary       438244
14 2023-01-15       C  North    888     85    Bob       788544
15 2023-01-16       D  South    783     38  Alice       613089
16 2023-01-17       A   East    828     22   John       685584
17 2023-01-18       B   West    798     43   Mary       636804
18 2023-01-19       C  North    885     68    Bob       783225
19 2023-01-20       D  South    555     67  Alice       308025